tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/ranziDevolCharCombustion/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
    volScalarFieldValue CELL.particles2  0.442
    volScalarFieldValue XYHW.particles2  0.347
    volScalarFieldValue LIGC.particles2  0.036
    volScalarFieldValue LIGH.particles2  0.108
    volScalarFieldValue LIGO.particles2  0.067
    volScalarFieldValue CHAR.particles2 0
    //volScalarFieldValue gas.particles2  1.0
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 0.10414 1);

        fieldValues
        (
            volScalarFieldValue alpha.air 0.42
            volScalarFieldValue alpha.particles1     0.58
            //volScalarFieldValue alpha.particles2     0

        );
    }
/*
    boxToCell
    {
        box (0.0127 0.061722 -1) (0.0254  0.074422 1);

        fieldValues
        (
            volScalarFieldValue alpha.air 0.489
            volScalarFieldValue alpha.particles1     0.30
            volScalarFieldValue alpha.particles2     0.30
            volScalarFieldValue CELL.particles2     0.4
            volScalarFieldValue HCE.particles2      0.227
            volScalarFieldValue LIGC.particles2     0.094
            volScalarFieldValue LIGH.particles2     0.094
            volScalarFieldValue LIGO.particles2     0.096
            volScalarFieldValue Char.particles2    0
        );
    }*/
);



/*defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
    volScalarFieldValue cellulose.particles2  0
    volScalarFieldValue char.particles2  0
);

regions
(
    boxToCell
    {
        box (-0.15 0 -1) (0.15 0.0708 1);

        fieldValues
        (
            volScalarFieldValue alpha.air 0.41
            volScalarFieldValue alpha.particles1    0.59
            volScalarFieldValue cellulose.particles2  0.40
            volScalarFieldValue hemicellulose.particles2  0.38
            volScalarFieldValue lignin.particles2  0.22
            volScalarFieldValue char.particles2  0
        );
    }
);*/


// ************************************************************************* //
